#include "Result.h"

//-----------------------------------
// コンストラクタ
//-----------------------------------
Result::Result(int block_break, int time)
{
	


	if (block_break == 0)
	{

	}
	

	//残りブロック＊時間
	score = block_break * time;
}

//-----------------------------------
// デストラクタ
//-----------------------------------
Result::~Result()
{

}

//-----------------------------------
// 更新
//-----------------------------------
void Result::Update(Key* key)
{

}

//-----------------------------------
// 描画
//-----------------------------------
void Result::Draw() const
{

}

//-----------------------------------
// 遷移
//-----------------------------------
AbstractScene* Result::ChangeScene()
{
	return this;
}
